/*******************************************************************************
 * 文件   ：task_monitor.c
 * 功能   ：监控任务——周期性采集电压与三路温度并打印
 * 说明   ：本任务优先级放低，因为采集是阻塞式的；
 *          “低优先级任务里可以放心用阻塞式 API”正是 RTOS 的价值所在
 ******************************************************************************/

#include "tasks.h"
#include "sense.h"
#include <stdio.h>
#include "log.h"

#define MONITOR_PERIOD_MS 1000  //采集周期（毫秒）


/*******************************************************************************
 * 函数名：TaskMonitor
 * 功  能：监控任务主体：每秒采集一次并打印
 * 参  数：argument —— 创建任务时传入的参数（本任务不用）
 * 返回值：无（永不返回）
 * 说  明：打印用“整数放大 10 倍”的方式，避免 MicroLIB 不支持浮点打印的问题
 ******************************************************************************/
void TaskMonitor(void *argument)
{
    vTaskDelay(pdMS_TO_TICKS(5000));
    sense_data_t data;

    /*==============================
     *   #1. 任务主循环（永不退出）
     ==============================*/
    for (;;)
    {
        /*===============================================================
         *   #2. 采集全部模拟量（内部是阻塞式 ADC 转换，但本任务优先级低，
         *       阻塞期间高优先级任务照常运行）
         ================================================================*/
        sense_read_all(&data);

        /*=========================================================================
         *   #3. 打印结果
         *       注意：Keil 的 MicroLIB 不支持 %f，所以把浮点数放大 10 倍用整数打印
         =========================================================================*/
        LOG_INFO("\r\n[monitor] \t电压=%u.%uV \t环温=%d.%dC \t舱温=%d.%dC \t板温=%d.%dC\r\n",
        (unsigned)(data.voltage * 10) / 10, (unsigned)(data.voltage * 10) % 10,
        (int)(data.temp_env * 10) / 10, (int)(data.temp_env * 10) % 10,
        (int)(data.temp_ipc * 10) / 10, (int)(data.temp_ipc * 10) % 10,
        (int)(data.temp_pcb * 10) / 10, (int)(data.temp_pcb * 10) % 10);
        /*==========================
         *   #4. 睡 1 秒（让出 CPU）
         ===========================*/
        vTaskDelay(pdMS_TO_TICKS(MONITOR_PERIOD_MS));
    }
}

